УТ_для_edt/src/Catalogs/смартШаблоныПечатныхФорм/смартШаблоныПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартШаблоныПечатныхФорм</name>
  <comment>#Б-3164 смарт: Лопато 20.05.2025 //Печать договора из Заказа клиента. Функциональное описание новой обработки.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОбъектНазначения</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомандыПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПечати</name>
    <type>
      <types>CatalogRef.смартАлгоритмыПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Модули</name>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Модуль</name>
      <type>
        <types>CatalogRef.смартМодулиПечатныхФорм</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВидимости</name>
      <type>
        <types>CatalogRef.смартАлгоритмыПроверки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиДанных</name>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартМодулиПечатныхФорм/смартМодулиПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартМодулиПечатныхФорм</name>
  <comment>#Б-3164 смарт: Лопато 20.05.2025 //Печать договора из Заказа клиента. Функциональное описание новой обработки.</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РазрывСтраницыWord</name>
      <description>Разрыв страницы Word</description>
    </items>
  </predefined>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>#Б-3746 смарт: Лопато 08.07.2025 //Справочник Модули печатных форм (смарт). Доработка. </comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаМакета</name>
    <comment>#Б-3746 смарт: Лопато 08.07.2025 //Справочник Модули печатных форм (смарт). Доработка. </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоваяСтраница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМодуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрВложенногоМодуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбласти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрОбласти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьОсновнойМакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсточникиДанных</name>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыШаблона</name>
    <attributes>
      <name>ПараметрШаблона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>450</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизвольныйКод</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбластиШаблона</name>
    <attributes>
      <name>ОбластьШаблона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВывода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитКоллекцииЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПараметровМакета</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокОбластейМакета</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеМодули</name>
    <attributes>
      <name>Модуль</name>
      <type>
        <types>CatalogRef.смартМодулиПечатныхФорм</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПечати</name>
      <type>
        <types>CatalogRef.смартАлгоритмыПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяОбласти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрОбласти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитКоллекцииЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартШаблоныПечатныхФормСервер/Module.bsl
// Дополняет список команд шаблонами печати.
Процедура ПриПолученииКомандПечати(КомандыПечати, ОбъектМетаданных) Экспорт

	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных);
	
	ОбъектМетаданных = Справочники.ИдентификаторыОбъектовМетаданных.ОбъектМетаданныхПоИдентификатору(ИдентификаторОбъектаМетаданных, Ложь);
	
	ДанныеШаблонов = ПолучитьШаблоныПоИдентификаторуОбъектаМетаданных(ИдентификаторОбъектаМетаданных);
	
	Для Каждого СтрШаблон Из ДанныеШаблонов Цикл;
		
		Если НЕ Пользователи.РолиДоступны("ПолныеПрава", , Ложь) 
			И СтрШаблон.ТестовыйРежим Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		КомандаПечати = КомандыПечати.Добавить();

		КомандаПечати.Идентификатор 				 	= СтрЗаменить(СтрШаблон.Ссылка.УникальныйИдентификатор(), "-", "_");
		КомандаПечати.Представление 				 	= СтрШаблон.Наименование;
		КомандаПечати.Обработчик 					 	= "смартШаблоныПечатныхФормКлиент.ПечатьПоШаблону";
		КомандаПечати.Порядок 							= 100;
		КомандаПечати.Картинка 					 		= БиблиотекаКартинок.ФорматWord2007;
		
	КонецЦикла;	
	
КонецПроцедуры

//Формирует печатную форму по шаблону
Функция СформироватьПечатнуюФормуПоШаблону(ОбъектПечати, Шаблон) Экспорт

	РезультатПечатнаяФорма = Неопределено;
	ПечатнаяФорма = Неопределено;
	ТипМакета = Неопределено;
	ЭтоПервыйМодуль = Истина;
	ПечатнаяФормаИнициализирована = Ложь;
	
	ОписаниеОшибки = "";
	
	НомерРаздела = 0;
	НомерПриложения = 0;

	СтруктураПараметров = Новый Структура;
	
	Для Каждого СтрокаМодуля Из Шаблон.Модули Цикл

		Если НЕ СтрокаМодуля.Используется Тогда
			Продолжить;
		КонецЕсли;	

		//Проверка условия печати
		Если смартШаблоныПечатныхФормСервер.ПроверитьУсловиеПечатиМодуля(ОбъектПечати, СтрокаМодуля.УсловиеВидимости) Тогда
			
			//Инициализация печатной формы	
			Если НЕ ПечатнаяФормаИнициализирована Тогда
				
				ПечатнаяФормаИнициализирована = ИнициализироватьПечатнуюФорму(ПечатнаяФорма, СтрокаМодуля.Модуль, ТипМакета, ОбъектПечати, Шаблон);
					
				Если НЕ ПечатнаяФормаИнициализирована Тогда
					Продолжить;				
				КонецЕсли;	

			КонецЕсли;	

			СтруктураПечати = Новый Структура;
			СтруктураПечати.Вставить("Модуль",	   СтрокаМодуля.Модуль);
			СтруктураПечати.Вставить("ИмяОбласти", СтрокаМодуля.Модуль.ИмяОбласти);
			
			//Печать модуля
			ВывестиМодульВПечатнуюФорму(ПечатнаяФорма, ТипМакета, ОбъектПечати, СтруктураПечати, СтруктураПараметров, 
										ЭтоПервыйМодуль, НомерРаздела, НомерПриложения, ОписаниеОшибки);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если ТипМакета = "MXL" Тогда
		
		РезультатПечатнаяФорма = ПечатнаяФорма;
		
	ИначеЕсли ТипМакета = "DOCX" Тогда 
		
		Если ТипЗнч(ПечатнаяФорма) = Тип("Структура") Тогда	
		
			РезультатПечатнаяФорма = смартУправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
		
			смартУправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
			
		Иначе
			
			РезультатПечатнаяФорма = ПечатнаяФорма;
			
		КонецЕсли;	
			
	КонецЕсли;
	
	Возврат РезультатПечатнаяФорма;
	
КонецФункции	

//Выводит модуль в печатную форму
Процедура ВывестиМодульВПечатнуюФорму(ПечатнаяФорма, ТипМакета, ОбъектПечати, СтруктураПечати, СтруктураПараметров, ЭтоПервыйМодуль, НомерРаздела, НомерПриложения, ОписаниеОшибки) Экспорт
	
	ТекущийМодуль = СтруктураПечати.Модуль;
	
	//Вывод модулей по коллекции
	Если СтруктураПечати.Свойство("КоллекцияЗначений")
		И (ТипЗнч(СтруктураПечати.КоллекцияЗначений) = Тип("Массив")
		   ИЛИ ТипЗнч(СтруктураПечати.КоллекцияЗначений) = Тип("Соответствие")
		   ИЛИ ТипЗнч(СтруктураПечати.КоллекцияЗначений) = Тип("Структура")
		   ИЛИ ТипЗнч(СтруктураПечати.КоллекцияЗначений) = Тип("ФиксированноеСоответствие")
		   ИЛИ ТипЗнч(СтруктураПечати.КоллекцияЗначений) = Тип("ФиксированнаяСтруктура")) Тогда
		
		Для Каждого СтрокаКоллекции Из СтруктураПечати.КоллекцияЗначений Цикл

			СтруктураПечатиКоллекцияЗначений = Новый Структура;
			СтруктураПечатиКоллекцияЗначений.Вставить("Модуль",	   		 ТекущийМодуль);
			СтруктураПечатиКоллекцияЗначений.Вставить("ИмяОбласти", 	 ТекущийМодуль.ИмяОбласти);
			СтруктураПечатиКоллекцияЗначений.Вставить("СтрокаКоллекции", СтрокаКоллекции);
			
			СтруктураПараметров.Вставить("СтрокаКоллекции", СтрокаКоллекции);
			
			ВывестиМодульВПечатнуюФорму(ПечатнаяФорма, ТипМакета, ОбъектПечати, 
										СтруктураПечатиКоллекцияЗначений, СтруктураПараметров, 
										ЭтоПервыйМодуль, НомерРаздела, НомерПриложения, ОписаниеОшибки);

		КонецЦикла;

		СтруктураПараметров.Вставить("СтрокаКоллекции", Неопределено);
		
		Возврат;
		
	КонецЕсли;	
	
	ТипМакета = ТекущийМодуль.ТипМакета;
	
	//Получение макета модуля
	МакетМодуля = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(ТекущийМодуль);

	Если МакетМодуля = Неопределено
		 И (ТекущийМодуль.ВложенныеМодули.Количество() = 0
			ИЛИ ТекущийМодуль.ПечататьОсновнойМакет) Тогда
		Возврат;
	КонецЕсли;

	//Параметры модуля
	ПолучитьПараметрыМодуля(СтруктураПараметров, ТекущийМодуль, ОбъектПечати, ПечатнаяФорма, ОписаниеОшибки);
	
	//Нумерация разделов
	ВидМодуля = ТекущийМодуль.ВидМодуля;
	
	Если ВидМодуля = "Новый раздел" Тогда
		НомерРаздела = НомерРаздела + 1;
	ИначеЕсли ВидМодуля = "Новое приложение" Тогда
		НомерПриложения = НомерПриложения + 1;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("НомерРаздела", 	НомерРаздела);
	СтруктураПараметров.Вставить("НомерПриложения", НомерПриложения);
	
	//Вывод макета с новой страницы
	Если ТекущийМодуль.НоваяСтраница Тогда
		
		Если ТипМакета = "MXL" Тогда
			ПечатнаяФорма.ВывестиГоризонтальныйРазделительСтраниц();
		ИначеЕсли ТипМакета = "DOCX" Тогда	
			ВставитьРазрывСтраницыWord(ПечатнаяФорма);
		КонецЕсли;
		
	КонецЕсли;

	//Вывод основного макета модуля
	Если ТекущийМодуль.ПечататьОсновнойМакет
		 ИЛИ ТекущийМодуль.ВложенныеМодули.Количество() = 0 Тогда
	
		Если ТипМакета = "MXL" Тогда
			
			Если МакетМодуля.Области.Количество() > 0 Тогда

				Для Каждого ОбластьМакета Из МакетМодуля.Области Цикл 
					
					//Заполнение параметров
					ОбластьТабДок = МакетМодуля.ПолучитьОбласть(ОбластьМакета.Имя);
					ОбластьТабДок.Параметры.Заполнить(СтруктураПараметров);

					ЗаполнитьПараметрыСтрокиКоллекцииMXL(ОбластьТабДок, СтруктураПараметров);
					ЗаполнитьПараметрыСтрокиКоллекцииMXL(ОбластьТабДок, СтруктураПечати);
					
					//Вывод макета
					ПечатнаяФорма.Вывести(ОбластьТабДок);
					
				КонецЦикла;
				
			Иначе
				
				//Заполнение параметров
				МакетМодуля.Параметры.Заполнить(СтруктураПараметров);

				ЗаполнитьПараметрыСтрокиКоллекцииMXL(МакетМодуля, СтруктураПараметров);
				ЗаполнитьПараметрыСтрокиКоллекцииMXL(МакетМодуля, СтруктураПечати);
				
				//Вывод макета
				ПечатнаяФорма.Вывести(МакетМодуля);
				
			КонецЕсли;	
			
		ИначеЕсли ТипМакета = "DOCX" Тогда	
		
			МакетWord = смартУправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетМодуля, "");

			//Перед выводом проверим перенесем картинки из иакета
			Если НЕ ЭтоПервыйМодуль Тогда

				ПеренестиКартинкиИзМакетаВПечатнуюФорму(ПечатнаяФорма, МакетWord);
				
			КонецЕсли;	
			
			//Получение имени области
			ИмяОбластиПечати = ?(ЗначениеЗаполнено(СтруктураПечати.ИмяОбласти), СтруктураПечати.ИмяОбласти, "Тело");

			Если ЗначениеЗаполнено(ТекущийМодуль.ПараметрОбласти) Тогда
				
				ПолучитьИмяОбластиИзПараметров(ИмяОбластиПечати, ТекущийМодуль.ПараметрОбласти, СтруктураПараметров);
				
			КонецЕсли;
			
			Если СтруктураПечати.Свойство("ПараметрОбласти")
				И ЗначениеЗаполнено(СтруктураПечати.ПараметрОбласти) Тогда

				ПолучитьИмяОбластиИзПараметров(ИмяОбластиПечати, СтруктураПечати.ПараметрОбласти, СтруктураПараметров);
				ПолучитьИмяОбластиИзПараметров(ИмяОбластиПечати, СтруктураПечати.ПараметрОбласти, СтруктураПечати);
				
			КонецЕсли;
			
			//Вывод дополнительных областей
			Для Каждого СтрОбласти Из ТекущийМодуль.ОбластиШаблона Цикл
				
				Если ПроверитьУсловиеВыводаОбласти(СтрОбласти, ОбъектПечати, СтруктураПараметров) Тогда

				    ОписаниеОбласти = Новый Структура("ТипОбласти, ИмяОбласти", "Общая", СтрОбласти.ОбластьШаблона);
				    ОбластьМакета = смартУправлениеПечатью.ОбластьМакета(МакетWord, ОписаниеОбласти);

				    смартУправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, ОбластьМакета, Ложь);

					//Заполнение параметров
					смартУправлениеПечатью.ЗаполнитьПараметры(ПечатнаяФорма, СтруктураПараметров);
					
					ЗаполнитьПараметрыСтрокиКоллекцииWord(ПечатнаяФорма, СтруктураПараметров);
					ЗаполнитьПараметрыСтрокиКоллекцииWord(ПечатнаяФорма, СтруктураПечати);
					
				КонецЕсли;
				
			КонецЦикла;	
			
			//Вывод основного макета
		    ОписаниеОбласти = Новый Структура("ТипОбласти, ИмяОбласти", "Общая", ИмяОбластиПечати);
		    ОбластьМакета = смартУправлениеПечатью.ОбластьМакета(МакетWord, ОписаниеОбласти);

		    смартУправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, ОбластьМакета, Ложь);

			//Заполнение параметров
			смартУправлениеПечатью.ЗаполнитьПараметры(ПечатнаяФорма, СтруктураПараметров);

			ЗаполнитьПараметрыСтрокиКоллекцииWord(ПечатнаяФорма, СтруктураПараметров);
			ЗаполнитьПараметрыСтрокиКоллекцииWord(ПечатнаяФорма, СтруктураПечати);
			
			смартУправлениеПечатью.ОчиститьСсылки(МакетWord);
			
		КонецЕсли;	

	КонецЕсли;	
	
	ЭтоПервыйМодуль = Ложь;
	
	//Вложенные модули
	Если ТекущийМодуль.ВложенныеМодули.Количество() > 0 Тогда
		
		МассивСтрокВложенныхМодулей = Новый Массив;
		
		//Получение одного вложенного модуля по параметру
		Если ЗначениеЗаполнено(ТекущийМодуль.ПараметрВложенногоМодуля) Тогда
			
			СтрокаВложенногоМодуля = ПолучитьВложенныйМодуль(ОбъектПечати, 
															 ТекущийМодуль.ВложенныеМодули, 
															 ТекущийМодуль.ПараметрВложенногоМодуля,
															 СтруктураПараметров);
			
			Если СтрокаВложенногоМодуля <> Неопределено Тогда
				МассивСтрокВложенныхМодулей.Добавить(СтрокаВложенногоМодуля);
			КонецЕсли;

		Иначе
			
			//Вывод вложенных модулей по условию
			Для Каждого СтрокаВложенногоМодуля Из ТекущийМодуль.ВложенныеМодули Цикл
				
				Если ЗначениеЗаполнено(СтрокаВложенногоМодуля.Модуль)
					И (НЕ ЗначениеЗаполнено(СтрокаВложенногоМодуля.УсловиеПечати) 
					   ИЛИ смартШаблоныПечатныхФормСервер.ПроверитьУсловиеПечатиМодуля(ОбъектПечати, СтрокаВложенногоМодуля.УсловиеПечати)) Тогда
					
					МассивСтрокВложенныхМодулей.Добавить(СтрокаВложенногоМодуля);
						

				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
			
		//Печать вложенных модулей
		Для Каждого СтрокаВложенногоМодуля Из МассивСтрокВложенныхМодулей Цикл
		
			//Получение имени области
			ИмяОбластиДляПечати = ?(ЗначениеЗаполнено(СтрокаВложенногоМодуля.ИмяОбласти), СтрокаВложенногоМодуля.ИмяОбласти, "Тело");

			Если ЗначениеЗаполнено(СтрокаВложенногоМодуля.ПараметрОбласти) Тогда

				ПолучитьИмяОбластиИзПараметров(ИмяОбластиДляПечати, СтрокаВложенногоМодуля.ПараметрОбласти, СтруктураПараметров);
				ПолучитьИмяОбластиИзПараметров(ИмяОбластиДляПечати, СтрокаВложенногоМодуля.ПараметрОбласти, СтруктураПечати);
				
			КонецЕсли;
				
			СтруктураПечатиВложенногоМодуля = Новый Структура;
			СтруктураПечатиВложенногоМодуля.Вставить("Модуль", 	   СтрокаВложенногоМодуля.Модуль);
			СтруктураПечатиВложенногоМодуля.Вставить("ИмяОбласти", ИмяОбластиДляПечати);

			Если ЗначениеЗаполнено(СтрокаВложенногоМодуля.РеквизитКоллекцииЗначений)
				И СтруктураПараметров.Свойство(СтрокаВложенногоМодуля.РеквизитКоллекцииЗначений) Тогда
				
				СтруктураПечатиВложенногоМодуля.Вставить("КоллекцияЗначений", 
					СтруктураПараметров[СтрокаВложенногоМодуля.РеквизитКоллекцииЗначений]);
				
			КонецЕсли;	
			
			//Вывод вложенного модуля
			ВывестиМодульВПечатнуюФорму(ПечатнаяФорма, ТипМакета, ОбъектПечати, СтруктураПечатиВложенногоМодуля, 
										СтруктураПараметров, ЭтоПервыйМодуль, НомерРаздела, НомерПриложения, ОписаниеОшибки)
															 
		КонецЦикла;													 

	КонецЕсли;
	
КонецПроцедуры

//Перенос картинок в печатную форму
Процедура ПеренестиКартинкиИзМакетаВПечатнуюФорму(ПечатнаяФорма, МакетWord);
	
	Если СтрНайти(МакетWord.СтруктураДокумента.СвязиКонтента, "relationships/image") <> 0 Тогда
		
		ТаблицаСвязейПечатнойФормы = ПечатнаяФорма.СтруктураДокумента.ТаблицаСвязейКонтента;
		ТаблицаСвязейМакета = МакетWord.СтруктураДокумента.ТаблицаСвязейКонтента;
		
		МаксНомерКлюча = 0;
		
		ВычислитьМаксНомерКлюча(МаксНомерКлюча, ТаблицаСвязейПечатнойФормы);
		ВычислитьМаксНомерКлюча(МаксНомерКлюча, ТаблицаСвязейМакета);

		ИмяКаталогаФайловПечатнойФормы = ПечатнаяФорма.ИмяКаталога + "word/media/";
		
		//++ #4254 смарт: Ермаков 02.09.2025 / Ошибка ЖР. Печать договора
		// Если в печатной форме нет картинок, то катлог media не создается автоматически
		ИмяКаталогаФайловПечатнойФормыФайл = Новый Файл(ИмяКаталогаФайловПечатнойФормы);
		Если Не ИмяКаталогаФайловПечатнойФормыФайл.Существует() Тогда
			
			СоздатьКаталог(ИмяКаталогаФайловПечатнойФормы);
			
		КонецЕсли;
		//-- #4254 смарт: Ермаков 02.09.2025
		
		ИмяКаталогаФайловМакета = МакетWord.ИмяКаталога + "word/media/";
		
		Для Каждого СтрСвязи Из ТаблицаСвязейМакета Цикл
			
			Если СтрНайти(СтрСвязи.ИмяРесурса, "media/image") <> 0 Тогда
				
				МаксНомерКлюча = МаксНомерКлюча + 1;
				
				ИмяФайлаКартинки = СтрЗаменить(СтрСвязи.ИмяРесурса, "media/", "");
				ИмяФайлаИсточник = ИмяКаталогаФайловМакета + ИмяФайлаКартинки;
				
				ФайлКартинкиИсточник = Новый Файл(ИмяФайлаИсточник);
				
				Если ФайлКартинкиИсточник.Существует() Тогда
					
					УникальныйКлюч = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
					
					НовоеИмяФайлаКартинки = "image" + Строка(УникальныйКлюч) + ФайлКартинкиИсточник.Расширение;
					ИмяФайлаПриемник 	  = ИмяКаталогаФайловПечатнойФормы + НовоеИмяФайлаКартинки; 
					
					//Перенос картинки
					КопироватьФайл(ИмяФайлаИсточник, ИмяФайлаПриемник);
					
					//Новая строка связи
					НоваяСтрСвязи = ТаблицаСвязейПечатнойФормы.Добавить();
					
					НоваяСтрСвязи.ИдРесурса    = "rld" + Строка(МаксНомерКлюча);
					НоваяСтрСвязи.НомерРесурса = МаксНомерКлюча;
					НоваяСтрСвязи.ИмяРесурса   = "media/" + НовоеИмяФайлаКартинки;
					
					//Найти ИдРесурса в документе и заменить на новый ИдРесурса
					ОбластиМакетаЗамена = МакетWord.СтруктураДокумента.ОбластиДокумента;

					Для Каждого ОбластьМакетаЗамена Из ОбластиМакетаЗамена Цикл
						
						ОбластьМакетаЗамена.Значение.Текст 
							= СтрЗаменить(ОбластьМакетаЗамена.Значение.Текст, 
										  "blip r:embed=""" + СтрСвязи.ИдРесурса + """", 
										  "blip r:embed=""" + НоваяСтрСвязи.ИдРесурса + """");
						
					КонецЦикла;	
					
					//Запись Relationship в связи контента
					НоваяСтрокаСвязи = ПолучитьСтрокуСвязи(НоваяСтрСвязи.ИдРесурса, НовоеИмяФайлаКартинки);
									
					ПечатнаяФорма.СтруктураДокумента.СвязиКонтента 
						= СтрЗаменить(ПечатнаяФорма.СтруктураДокумента.СвязиКонтента, "</Relationships>", НоваяСтрокаСвязи);
									  
				КонецЕсли;	

			КонецЕсли;	
			
		КонецЦикла;	
			
	КонецЕсли;	

КонецПроцедуры	

//Получение параметров модуля
Процедура ПолучитьПараметрыМодуля(СтруктураПараметров, Модуль, ОбъектСсылка, ПечатнаяФорма, ОписаниеОшибки) Экспорт

	Для Каждого СтрокаПараметра Из Модуль.ПараметрыШаблона Цикл
			
		// Получить ЗначениеПараметра из произвольного кода
		ЗначениеПроизвольногоКода = Ложь;
		ЗначениеПараметраПолучено = Ложь;
		
		Если НЕ ЗначениеПараметраПолучено
			И ЗначениеЗаполнено(СокрЛП(СтрокаПараметра.ПроизвольныйКод)) Тогда
			
			ЗначениеПараметра = ВыполнитьПроизвольныйКод(СокрЛП(СтрокаПараметра.ПроизвольныйКод), 
														 СтрокаПараметра, ОбъектСсылка, СтруктураПараметров, Модуль, ОписаниеОшибки);
														 
			Если ЗначениеПараметра <> Неопределено Тогда											 
				ЗначениеПараметраПолучено = Истина;
				ЗначениеПроизвольногоКода = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеПараметраПолучено
			И ЗначениеЗаполнено(СтрокаПараметра.ЗначениеПараметра) Тогда
			
			ЗначениеПараметра = СтрокаПараметра.ЗначениеПараметра;
			
			ЗначениеПараметраПолучено = Истина;
			
		КонецЕсли;	
			
		Если НЕ ЗначениеПараметраПолучено Тогда
			
			ОбрабатываемыйПараметр = "";
			
			Попытка
				
				Если СтрокаПараметра.РеквизитИмя = "Ссылка" Тогда
					
					ОбрабатываемыйПараметр = "Ссылка";
					ЗначениеПараметра	   = ОбъектСсылка;
					
				Иначе
					
					Если СтрНайти(СтрокаПараметра.РеквизитИмя, ".") = 0 Тогда
						
						Если СтруктураПараметров.Свойство(СтрЗаменить(СтрокаПараметра.РеквизитИмя, " ", "")) Тогда

							ОбрабатываемыйПараметр = СтрЗаменить(СтрокаПараметра.РеквизитИмя, " ", "");
							ЗначениеПараметра	   = СтруктураПараметров[ОбрабатываемыйПараметр];

						Иначе
							
							ОбрабатываемыйПараметр = СтрокаПараметра.РеквизитИмя;
							ЗначениеПараметра	   = ПолучитьЧерезТочки(ОбъектСсылка, ОбрабатываемыйПараметр);
							
						КонецЕсли;	
					
					Иначе

						ОбрабатываемыйПараметр = СтрокаПараметра.РеквизитИмя;

						МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ОбрабатываемыйПараметр), ".");
						
						Если МассивРеквизитов.Количество() > 0 
							И СтруктураПараметров.Свойство(МассивРеквизитов[0]) Тогда
							
							ЗначениеПараметра = ПолучитьЧерезТочки(СтруктураПараметров, ОбрабатываемыйПараметр);
							
						Иначе
							
							ЗначениеПараметра = ПолучитьЧерезТочки(ОбъектСсылка, ОбрабатываемыйПараметр);
							
						КонецЕсли;	
					
					КонецЕсли;

				КонецЕсли;
					
			Исключение

				ОписаниеОшибки = ОписаниеОшибки + "|Ошибка обработки параметра: " + ОбрабатываемыйПараметр;
				
				Продолжить;
				
			КонецПопытки;		
		
		КонецЕсли;

		// Применить Формат
		Если ЗначениеЗаполнено(СтрокаПараметра.Формат) Тогда
			ЗначениеПараметра = Формат(ЗначениеПараметра, СокрЛП(СтрокаПараметра.Формат));
		КонецЕсли;	

		СтруктураПараметров.Вставить(СтрокаПараметра.ПараметрШаблона, ЗначениеПараметра);
	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПараметрыСтрокиКоллекцииWord(ПечатнаяФорма, Знач СтруктураПараметры)

	Если СтруктураПараметры.Свойство("СтрокаКоллекции")
		И (ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("Соответствие")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("Структура")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("ФиксированноеСоответствие")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("ФиксированнаяСтруктура")) Тогда
		
		смартУправлениеПечатью.ЗаполнитьПараметры(ПечатнаяФорма, СтруктураПараметры.СтрокаКоллекции);
		
	КонецЕсли;	

КонецПроцедуры	

Процедура ЗаполнитьПараметрыСтрокиКоллекцииMXL(Макет, Знач СтруктураПараметры)

	Если СтруктураПараметры.Свойство("СтрокаКоллекции")
		И (ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("Соответствие")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("Структура")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("ФиксированноеСоответствие")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("ФиксированнаяСтруктура")) Тогда
		
		Макет.Параметры.Заполнить(СтруктураПараметры.СтрокаКоллекции);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьИмяОбластиИзПараметров(ИмяОбластиПечати, Знач ПараметрОбласти, Знач СтруктураПараметры)
	
	Если СтруктураПараметры.Свойство(ПараметрОбласти) Тогда
		ИмяОбластиПечати = СтруктураПараметры[ПараметрОбласти];
	КонецЕсли;

	Если СтруктураПараметры.Свойство("СтрокаКоллекции")
		И (ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("Соответствие")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("Структура")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("ФиксированноеСоответствие")
		   ИЛИ ТипЗнч(СтруктураПараметры.СтрокаКоллекции) = Тип("ФиксированнаяСтруктура")) Тогда
		
		Если СтруктураПараметры.СтрокаКоллекции.Свойство(ПараметрОбласти) Тогда
			ИмяОбластиПечати = СтруктураПараметры.СтрокаКоллекции[ПараметрОбласти];
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции				

Функция ПолучитьСтрокуСвязи(ИдРесурса, ИмяФайла)

	Возврат СтрШаблон("<Relationship Id=""%1"" Type=""http://schemas.openxmlformats.org/officeDocument/2006/relationships/image"" Target=""media/%2""/></Relationships>",
					  ИдРесурса, ИмяФайла);

КонецФункции					  

Функция ИнициализироватьПечатнуюФорму(ПечатнаяФорма, Модуль, ТипМакета, ОбъектПечати, Шаблон)
	
	//Получение макета модуля
	МакетМодуля = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(Модуль);

	Если МакетМодуля = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ТипМакета = Модуль.ТипМакета;
	
	Если ТипМакета = "MXL" Тогда

		ПечатнаяФорма = Новый ТабличныйДокумент;
		
		СкопироватьПараметрыТабличногоДокумента(ПечатнаяФорма, МакетМодуля);

	ИначеЕсли ТипМакета = "DOCX" Тогда	
		
		//Инициалицазия печатной формы
		МакетWord = смартУправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетМодуля, "");
		
	    ПечатнаяФорма = смартУправлениеПечатью.ИнициализироватьПечатнуюФорму(,, МакетWord);
		
		//Вывод колонтитулов из первого макета
	    ОписаниеОбластиКолонтитул = Новый Структура("ТипОбласти, ИмяОбласти", "ВерхнийКолонтитул", "ВерхнийКолонтитул");
	    ОбластьМакетаКолонтитул	= смартУправлениеПечатью.ОбластьМакета(МакетWord, ОписаниеОбластиКолонтитул);
	    смартУправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, ОбластьМакетаКолонтитул);

		ОписаниеОбластиНижнийКолонтитул = Новый Структура("ТипОбласти, ИмяОбласти", "НижнийКолонтитул", "НижнийКолонтитул");
		ОбластьМакетаНижнийКолонтитул = смартУправлениеПечатью.ОбластьМакета(МакетWord, ОписаниеОбластиНижнийКолонтитул);
		смартУправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, ОбластьМакетаНижнийКолонтитул);
		
		смартУправлениеПечатью.ОчиститьСсылки(МакетWord);
		
	Иначе	
		
		Возврат Ложь;
		
	КонецЕсли;	

	Возврат Истина;
	
КонецФункции

Функция ПолучитьСхемуСКДПоОбъекту(Объект) Экспорт

	СхемаОбъекта = Неопределено;
	
	Если Не ЗначениеЗаполнено(Объект) Тогда
		Возврат СхемаОбъекта;
	КонецЕсли;	
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
		ОбъектМетаданных = Справочники.ИдентификаторыОбъектовМетаданных.ОбъектМетаданныхПоИдентификатору(Объект, Ложь);
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект)) Тогда
		ОбъектМетаданных = Объект.Метаданные();	
	Иначе	
		Возврат СхемаОбъекта;
	КонецЕсли;
	
	ИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
	
	СхемыОбъекта = смартУправлениеПечатью.СхемыКомпоновкиДанныхИсточникаПолей(ИмяОбъектаМетаданных, Истина);
	
	Для Каждого Схема Из СхемыОБъекта Цикл
		
		Если Схема.Представление = ИмяОбъектаМетаданных Тогда
			СхемаОбъекта = Схема.Значение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СхемаОбъекта <> Неопределено Тогда
		
		ПолеВыбора = СхемаОбъекта.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		ПолеВыбора.Использование = Истина;
		
		ГруппировкаКомпоновкиДанных = СхемаОбъекта.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));							   
		ГруппировкаКомпоновкиДанных.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		ГруппировкаКомпоновкиДанных.Использование = Истина;
		
		ПараметрПредмет = СхемаОбъекта.Параметры.Добавить(); 
		ПараметрПредмет.Имя = "Предмет";
		ПараметрПредмет.Значение = "";
		ПараметрПредмет.Использование = ИспользованиеПараметраКомпоновкиданных.Всегда;
		
	КонецЕсли;	
	
	Возврат СхемаОбъекта;
	
КонецФункции	

Функция ПолучитьШаблоныПоИдентификаторуОбъектаМетаданных(ИдентификаторОбъектаМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Ссылка,
	|	Наименование КАК Наименование,
	|	ОбъектНазначения КАК ОбъектНазначения,
	|	Используется КАК Используется,
	|	ИмяКомандыПечати КАК ИмяКомандыПечати,
	|	УсловиеПечати КАК УсловиеПечати,
	|	ТестовыйРежим КАК ТестовыйРежим
	|ИЗ
	|	Справочник.смартШаблоныПечатныхФорм
	|ГДЕ
	|	Используется
	|	И НЕ ЭтоГруппа
	|	И ОбъектНазначения = &ИдентификаторОбъектаМетаданных
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьШаблонПечатиПоИдентификаторуПечатнойФормы(Идентификатор) Экспорт
	
	УИДСтрока = СтрЗаменить(Идентификатор, "_", "-"); 
	
	Попытка
		СсылкаНаШаблон = Справочники.смартШаблоныПечатныхФорм.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДСтрока));
	Исключение
		СсылкаНаШаблон = Неопределено;
	КонецПопытки;	
	
	Возврат СсылкаНаШаблон;

КонецФункции

Функция ПроверитьУсловиеПечатиШаблона(ОбъектПечати, Шаблон) Экспорт
	
	Результат = Истина;
	
	СтруктураДанныхШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон, "УсловиеПечати");
	
	Если ЗначениеЗаполнено(СтруктураДанныхШаблона.УсловиеПечати)
		И НЕ смартРаботаСАлгоритмамиПроверки.АлгоритмПоПредметуВыполняется(ОбъектПечати, СтруктураДанныхШаблона.УсловиеПечати) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не выполнены условия печати """ 
											  + СокрЛП(СтруктураДанныхШаблона.УсловиеПечати) 
											  + """ по шаблону """ + СокрЛП(Шаблон) + """");
											  
		Результат = Ложь;

	КонецЕсли;
	
	Возврат Результат;
												
КонецФункции

Функция ПроверитьУсловиеПечатиМодуля(ОбъектПечати, УсловиеВидимости) Экспорт
	
	Результат = Истина;
	
	Если ЗначениеЗаполнено(УсловиеВидимости)
		И НЕ смартРаботаСАлгоритмамиПроверки.АлгоритмПоПредметуВыполняется(ОбъектПечати, УсловиеВидимости) Тогда
		
		Результат = Ложь;

	КонецЕсли;
	
	Возврат Результат;
												
КонецФункции

Процедура ВставитьРазрывСтраницыWord(ПечатнаяФорма)
	
	МодульРазрывСтраницыWord = Справочники.смартМодулиПечатныхФорм.РазрывСтраницыWord;
	МакетМодуляРазрывСтраницы = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(МодульРазрывСтраницыWord);
	МакетРазрывСтраницыWord = смартУправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетМодуляРазрывСтраницы, "");
	
	ОписаниеОбластиРазрывСтраницыWord = Новый Структура("ТипОбласти, ИмяОбласти", "Общая", "РазрывСтраницы");
	ОбластьМакетаРазрывСтраницыWord = смартУправлениеПечатью.ОбластьМакета(МакетРазрывСтраницыWord, ОписаниеОбластиРазрывСтраницыWord);
	смартУправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, ОбластьМакетаРазрывСтраницыWord, Истина);
	
	смартУправлениеПечатью.ОчиститьСсылки(МакетРазрывСтраницыWord);
	
КонецПроцедуры	

Функция ПолучитьВложенныйМодуль(ОбъектПечати, ВложенныеМодули, ПараметрВложенногоМодуля, СтруктураПараметров)

	Результат = Неопределено;
	
	//Поиск по параметру
	Если ЗначениеЗаполнено(ПараметрВложенногоМодуля) Тогда
		
		ЗначениеПараметраВложенногоМодуля = Неопределено;
		
		Если ПараметрВложенногоМодуля = "Ссылка" Тогда
			ЗначениеПараметраВложенногоМодуля = ОбъектПечати;
		ИначеЕсли СтрНайти(ПараметрВложенногоМодуля, ".") <> 0 Тогда

			Если ЗначениеПараметраВложенногоМодуля = Неопределено Тогда
				Попытка
					ЗначениеПараметраВложенногоМодуля = ПолучитьЧерезТочки(СтруктураПараметров, ПараметрВложенногоМодуля);
				Исключение
					ОписаниеОшибки = ОписаниеОшибки + "|Ошибка обработки параметра: " + ПараметрВложенногоМодуля;
				КонецПопытки;		
			КонецЕсли;
			
			Попытка
				ЗначениеПараметраВложенногоМодуля = ПолучитьЧерезТочки(ОбъектПечати, ПараметрВложенногоМодуля);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки + "|Ошибка обработки параметра: " + ПараметрВложенногоМодуля;
			КонецПопытки;		

		ИначеЕсли СтруктураПараметров.Свойство(СтрЗаменить(ПараметрВложенногоМодуля, " ", "")) Тогда
			ЗначениеПараметраВложенногоМодуля = СтруктураПараметров[СтрЗаменить(ПараметрВложенногоМодуля, " ", "")];
		КонецЕсли;
			
		Если ЗначениеПараметраВложенногоМодуля <> Неопределено Тогда
			Результат = ВложенныеМодули.Найти(ЗначениеПараметраВложенногоМодуля, "ЗначениеПараметра");
		КонецЕсли;
		
	КонецЕсли;	

	Возврат Результат;	
	
КонецФункции		

Функция ТипПоМетаданнымОбъекта(ОбъектМетаданных) Экспорт
	
	ИмяЗначенияПеречисления = ОбъектМетаданных.Имя;
	
	Если Метаданные.Справочники.Найти(ИмяЗначенияПеречисления) <> Неопределено Тогда
		Возврат ТипЗнч(Справочники[ИмяЗначенияПеречисления].ПустаяСсылка());
	ИначеЕсли Метаданные.БизнесПроцессы.Найти(ИмяЗначенияПеречисления) <> Неопределено Тогда
		Возврат ТипЗнч(БизнесПроцессы[ИмяЗначенияПеречисления].ПустаяСсылка());
	ИначеЕсли Метаданные.Документы.Найти(ИмяЗначенияПеречисления) <> Неопределено Тогда
		Возврат ТипЗнч(Документы[ИмяЗначенияПеречисления].ПустаяСсылка());
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru = 'Непредвиденное значение типа объекта, обратитесь к администратору.'");
	
КонецФункции

Процедура ПодобратьОбразецПоОбъектуМетаданных(ОбъектМетаданных) Экспорт
	
	Результат = Неопределено;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПсевдонимЗаданнойТаблицы.Ссылка КАК Ссылка
	|ИЗ
	|	&Таблица КАК ПсевдонимЗаданнойТаблицы
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Таблица", ОбъектМетаданных.ПолноеИмя());
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Образец = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура СкопироватьПараметрыТабличногоДокумента(ТабДокПриемник, ТабДокИсточник) Экспорт
	
	СвойстваТабличногоДокумента = "Автомасштаб, МасштабПечати, РазмерСтраницы, ОриентацияСтраницы, 
								  |ШиринаСтраницы, ВысотаСтраницы, ПолеСверху, ПолеСлева, ПолеСнизу, 
								  |ПолеСправа, РазмерКолонтитулаСверху, РазмерКолонтитулаСнизу";
	
	ЗаполнитьЗначенияСвойств(ТабДокПриемник, ТабДокИсточник, СвойстваТабличногоДокумента);
	
КонецПроцедуры

Функция ИменаПараметровТабличногоДокумента(ТабДок) Экспорт 
    
	КоллекцияИменПараметров = Новый Соответствие;

	Для НомерРяда = 1 По ТабДок.ВысотаТаблицы Цикл
		
		Для НомерКолонки = 1 По ТабДок.ШиринаТаблицы Цикл
			
			ОбластьЯчейка = ТабДок.Область(НомерРяда, НомерКолонки, НомерРяда, НомерКолонки);
			
			Если НомерКолонки = 1 Тогда
				ОбластьЯчейка.Текст = Символы.Таб + Символы.Таб + ОбластьЯчейка.Текст;	
			КонецЕсли;
				
			ПараметрыТекста = смартУправлениеПечатью.НайтиПараметрыВТексте(ОбластьЯчейка.Текст);

			Для Каждого Параметр Из ПараметрыТекста Цикл
				
				ИмяПараметра = ОчиститьКвадратныеСкобки(Параметр);
				
		        КоллекцияИменПараметров.Вставить(ИмяПараметра, ИмяПараметра);
	
			КонецЦикла; 
				
		КонецЦикла;

		НомерКолонки = Неопределено;

	КонецЦикла;

	НомерРяда = Неопределено; 

	Возврат КоллекцияИменПараметров

КонецФункции

Функция ИменаПараметровДокументаWord(МакетМодуля) Экспорт 
    
	МассивПараметров = Новый Массив;
	
	МакетWord = смартУправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетМодуля, "");
	
	Для Каждого Область Из МакетWord.СтруктураДокумента.ОбластиДокумента Цикл
		
		НайтиПараметрыWord(МассивПараметров, Область.Значение.Текст);
		
	КонецЦикла;	

	КоллекцияИменПараметров = Новый Соответствие;
	
	Для Каждого ЭлементПараметр Из МассивПараметров Цикл
		КоллекцияИменПараметров.Вставить(ЭлементПараметр, ЭлементПараметр);	
	КонецЦикла;	
	
	смартУправлениеПечатью.ОчиститьСсылки(МакетWord);
	
	Возврат КоллекцияИменПараметров;

КонецФункции

Процедура НайтиПараметрыWord(МассивПараметров, Знач Текст)

	НачалоПараметра = СтрНайти(Текст, "{v8 ");
	
	Если НачалоПараметра > 0 Тогда
		
		Текст = Прав(Текст, СтрДлина(Текст) - (НачалоПараметра+3));
		КонецПараметра = СтрНайти(Текст, "}");
		Если КонецПараметра > 0 Тогда
			ТекстПараметра = СокрЛП(Лев(Текст, КонецПараметра-1));
			МассивПараметров.Добавить(ТекстПараметра);
			Текст = Прав(Текст, СтрДлина(Текст) - (СтрДлина(ТекстПараметра) + 1));
		КонецЕсли;
		
		НачалоПараметра = СтрНайти(Текст, "{v8 ");
		Если НачалоПараметра > 0 Тогда
			НайтиПараметрыWord(МассивПараметров, Текст);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьПроизвольныйКод(ПроизвольныйКод, СтрокаПараметра, ОбъектСсылка, СтруктураПараметров, Модуль, ОписаниеОшибки)

	Результат = Неопределено;
	
	Попытка
		Выполнить(ПроизвольныйКод);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки + "|Ошибка выполнения произвольного кода параметра: " + СокрЛП(СтрокаПараметра.ПараметрШаблона);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЧерезТочки(СсылкаОбъекта, СтрокаСсылок) Экспорт

    Перем ПромежуточноеЗначение;
    
    МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(СтрокаСсылок), ".");
    
    Для Индекс = 0 По МассивРеквизитов.Количество() - 1 Цикл
		
		Если Индекс = 0 Тогда
			ПромежуточноеЗначение = СсылкаОбъекта[МассивРеквизитов[Индекс]];
		Иначе
        	ПромежуточноеЗначение = ПромежуточноеЗначение[МассивРеквизитов[Индекс]];
		КонецЕсли;
		
    КонецЦикла;

    Возврат ПромежуточноеЗначение;
        
КонецФункции

Функция ОчиститьКвадратныеСкобки(Строка)
	
	Если СтрНачинаетсяС(Строка, "[") И СтрЗаканчиваетсяНа(Строка, "]") Тогда
		Возврат Сред(Строка, 2, СтрДлина(Строка) - 2);
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

Функция ВозвратДанныхИзХранилища(АдресХранилищаОфисныйДокумент) Экспорт
	
	Возврат ПолучитьИзВременногоХранилища(АдресХранилищаОфисныйДокумент);
	
КонецФункции

Функция ПолучитьШаблонБрэндаНоменклатуры(НоменклатураСсылка) Экспорт
	
	смартШаблонБрэнда = НоменклатураСсылка.смартШаблонБрэнда; 
	
	Если НЕ ЗначениеЗаполнено(смартШаблонБрэнда) Тогда
		
		Запрос = Новый Запрос;

		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Номенклатура,
		|	смартШаблонБрэнда КАК смартШаблонБрэнда
		|ИЗ
		|	Справочник.Номенклатура
		|ГДЕ
		|	Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Номенклатура ТОЛЬКО ИЕРАРХИЯ";

		Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);

		РезультатЗапроса = Запрос.Выполнить();
		
		ДеревоИерархии = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ОбходДереваШаблонБрэнда(ДеревоИерархии, смартШаблонБрэнда);
		
	КонецЕсли;
	
	Возврат смартШаблонБрэнда;
		
КонецФункции

Процедура ОбходДереваШаблонБрэнда(ДеревоИерархии, смартШаблонБрэнда)

	Для Каждого СтрокаИерархии Из ДеревоИерархии.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаИерархии.смартШаблонБрэнда) Тогда
			смартШаблонБрэнда = СтрокаИерархии.смартШаблонБрэнда;
		КонецЕсли;	
		
		Если СтрокаИерархии.Строки.Количество() > 0 Тогда
			ОбходДереваШаблонБрэнда(СтрокаИерархии, смартШаблонБрэнда);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПроверитьУсловиеВыводаОбласти(СтрОбласти, Знач ОбъектСсылка, Знач СтруктураПараметров)

	Результат = Истина;

	Если НЕ ЗначениеЗаполнено(СтрОбласти.УсловиеВывода) Тогда
		
		Возврат Результат;

	Иначе
		
		Попытка
			Выполнить(СтрОбласти.УсловиеВывода);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки + "|Ошибка проверки условия вывода области: " + СокрЛП(СтрОбласти.ОбластьШаблона);
		КонецПопытки;

	КонецЕсли;		
		
	Возврат Результат;
	
КонецФункции	

#Область Склонения
// Функция для склонения одного слова!!!
// z1 - само слово
// z2 - номер падежа
// z3 - пол
// z4 - 1-склонять как фамилию, 2-имя, 3-отчество
Функция ПадежС(z1, Знач z2 = 2, Знач z3 = "*", z4 = 0) Экспорт
	
	z5 = Найти(z1, "-");
	z6 = ?(z5 = 0, "", "-" + ПадежС(Сред(z1, z5 + 1, СтрДлина(z1) - z5 + 1), z2, z3, z4));
	z1 = НРег(?(z5 = 0, z1, Лев(z1, z5 - 1)));
	z7 = Прав(z1, 3);
	z8 = Прав(z7, 2);
	z9 = Прав(z8, 1);
	z5 = СтрДлина(z1);
	za = Найти("ая ия ел ок яц ий па да ца ша ба та га ка", z8);
	zb = Найти("аеёийоуэюяжнгхкчшщ", Лев(z7, 1));
	zc = Макс(z2, -z2);
	zd = ?(za = 4, 5, Найти("айяь", z9));
	
	zd = ?((zc = 1) 
		   ИЛИ (z9 = ".") 
		   ИЛИ ((z4 = 2) 
		   		И (Найти("оиеу" + ?(z3 = "ч", "", "бвгджзклмнпрстфхцчшщъ"), z9) > 0)) 
		   ИЛИ ((z4 = 1) 
		   		И (Найти("мия мяэ лия кия жая лея", z7) > 0)), 9, ?((zd = 4) 
				И (z3 = "ч"), 2, ?(z4 = 1, ?(Найти("оеиую", z9) + Найти("их ых аа еа ёа иа оа уа ыа эа юа яа", z8) > 0, 9, 
											 ?(z3 <> "ч", ?(za = 1, 7, ?(z9 = "а", ?(za > 18, 1, 6), 9)), 
											 ?(((Найти("ой ый", z8) > 0)
											   И (z5 > 4) И (Прав(z1, 4) <> "опой"))
											   ИЛИ ((zb > 10) И (za = 16)), 8, zd))), zd)));
											   
	ze = Найти("лец вей бей дец пец мец нец рец вец аец иец ыец бер", z7);
	
	zf = ?((zd = 8) И (zc <> 5), 
		   ?((zb > 15) ИЛИ (Найти("жий ний", z7) > 0), "е", "о"), 
		   ?(z1 = "лев", "ьв", 
		   		?((Найти("аеёийоуэюя", Сред(z1, z5 - 3 , 1)) = 0) 
				   И ((zb > 11) ИЛИ (zb = 0)) 
				   И (ze <> 45), "", ?(za = 7, "л", ?(za = 10, "к", 
				   									  ?(za = 13, "йц", 
													  	?(ze = 0, "", 
														  ?(ze < 12, "ь" + 
														    ?(ze = 1, "ц", ""), 
															  ?(ze < 37, "ц", 
															    ?(ze < 49, "йц", "р"))))))))));
																
	zf = ?((zd = 9) ИЛИ ((z4 = 3) 
		   И (z3 = "ы")), z1, Лев(z1, z5 - ?((zd > 6) ИЛИ (zf <> ""), 2, ?(zd > 0, 1, 0))) 
		   					  + zf 
							  + СокрП(Сред("а у а " 
							  		  + Сред("оыые", Найти("внч", z9) + 1, 1) + "ме " 
									  + ?(Найти("гжкхш", Лев(z8, 1)) > 0, "и", "ы") + " е у ойе я ю я ем" 
									  + ?(za = 16, "и", "е") + " и е ю ейе и и ь ьюи и и ю ейи ойойу ойойойойуюойойгомуго"
									  + ?((zf = "е") ИЛИ (za = 16) ИЛИ ((zb > 12) И (zb < 16)), "и", "ы") + "мм", 10 * zd + 2 * zc - 3, 2)));
									  
	Рез = ?("" = z1, "", ?(z4 > 0, ВРег(Лев(zf, 1)) + ?((z2 < 0) И (z4 > 1), ".", Сред(zf, 2)), zf) + z6);
	
	Возврат Рез;
	
КонецФункции

// z1 - фамилия имя отчество например Железняков Юрий Юрьевич
// z2 - Падеж ( по  умолчанию = 2 - родительный)
// 2 - родительный  ( нет кого?    ) Железнякова Юрия Юрьевича     
// 3 - дательный    ( кому?        ) Железнякову Юрию Юрьевичу 
// 4 - винительный  ( вижу кого?   ) Железнякова Юрия Юрьевича  
// 5 - творительный ( кем?         ) Железняковым Юрием Юрьевичем    
// 6 - предложный   ( о ком?       ) Железнякове Юрии Юрьевиче 
// Если задать Z2 меньше 0, то на выходе получим от -1=Железняков Ю. Ю. до -6=Железнякове Ю. Ю.
// z3 - параметр Пол может не указываться, но при наличии фамилий с 
// инициалами точное определение пола невозможно, поэтому предлагается задавать пол этим
// параметром  1 - мужской 2 - женский  
// ДЛЯ СКЛОНЕНИЯ ПРОФЕССИЙ ИСПОЛЬЗУЙТЕ ФУНКЦИЮ ПАДЕЖП И БУДЕТ ВАМ СЧАСТЬЕ!
// ---------------------------------------------------------------------------------------
// Бибик Галушка Цой Николайчик Наталия Петровна Герценберг Кривошей Капица-Метелица
// Если Падеж(Фио ,1 ,3),       то на выходе получим Фамилия Имя Отчество и т.д.
// Если Падеж(Фио ,1 ,3,"1" ),  то                   Фамилия 
// Если Падеж(Фио ,1 ,3,"2" ),  то                   Имя 
// Если Падеж(Фио ,1 ,3,"3" ),  то                   Отчество 
// Если Падеж(Фио, 1 ,3,"12" ), то                   Фамилия Имя 
// Если Падеж(Фио, 1 ,3,"23" ), то                   Имя Отчество 
// Если Падеж(Фио,-1 ,3,"231" ),то                   И. О. Фамилия 
// Если Падеж(Фио,-1 ,3,"23" ), то                   И. О.  
Функция Падежик(z1, z2 = 2, z3 = 3, Знач z4 = "123", z5 = 1) Экспорт
	
	Рез = ?(z5 < 4, 
			Падежик(СокрЛП(СтрЗаменить(
						Сред(z1, Найти(z1 + " ", " ") + 1), ".", ". ")), z2, z3, 
							СтрЗаменить(z4, z5, 
								ПадежС(Лев(z1, Найти(z1 + " ", " ") - 1), z2, 
									Сред("ча" + НРег(Прав(СокрП(z1), 1)), z3, 1), z5) + " "), z5 + 1), z4);
			
	Возврат Рез;
	
КонецФункции//Падежик

Функция Падеж(z1, z2 = 2, z3 = 3, Знач z4 = "123") Экспорт
	
	z1 = СокрП(z1);
	z5 = Прав(z1, 4);
	z6 = Найти("оглы кызы", z5);
	
	Рез = Падежик(?(z6 > 0, Лев(z1, СтрДлина(z1) - 5), z1), z2, z3, z4) 
		 	  + ?(z6 > 0, z5, "");

	Возврат Рез;
	
КонецФункции//Падеж

Функция ПадежП(Знач z1, Знач z2, z3 = 0) Экспорт
	
	z1 = СокрЛП(z1);
	z4 = Найти(z1 + " ", " ") + 1;
	z5 = Лев(z1, z4 - 2);
	z6 = Прав(z5, 2);
	
	z7 = ?((Найти("ая ий ый", z6) > 0)
		 И(Найти("ющий нный", Сред(z1, z4 - 5, 4)) = 0)
		 И(z3 = 0), "1", "*");
		 
	Рез = НРег(?((z6 = "ая") ИЛИ (Прав(z6, 1) = "а"), 
				 ПадежС(z5, z2, z7, 1) 
				 + " " 
				 + ПадежС(Сред(z1, z4), z2), ПадежС(z5, z2, "ч", 1)
				 + ?((z6 = "ий") И (Найти(z1, " ") = 0), 
				     "",
				 	 " " + ?(z7= "1", ПадежП(Сред(z1, z4), z2, Число(z7)), Сред(z1, z4)))));
	
	Возврат Рез;
	
КонецФункции

Функция ПолучитьСтруктуруСклонения(ЧислоПрописью) Экспорт
	
	ЧислоПрописью = СокрЛП(ЧислоПрописью);
	
	ПадежРодительный = Новый структура;
	
	ПадежРодительный.Вставить("Один","Одного");
	ПадежРодительный.Вставить("Два","Двух");
	ПадежРодительный.Вставить("Три","Трех");
	ПадежРодительный.Вставить("Четыре","Четырех");
	ПадежРодительный.Вставить("Пять","Пяти");
	ПадежРодительный.Вставить("Шесть","Шести");
	ПадежРодительный.Вставить("Семь","Семи");
	ПадежРодительный.Вставить("Восемь","Восьми");
	ПадежРодительный.Вставить("Девять","Девяти");
	ПадежРодительный.Вставить("Десять","Десяти");
	ПадежРодительный.Вставить("Одиннадцать","Одиннадцати");
	ПадежРодительный.Вставить("Двенадцать","Двенадцати");
	ПадежРодительный.Вставить("Тринадцать","Тринадцати");
	ПадежРодительный.Вставить("Четырнадцать","Четырнадцати");
	ПадежРодительный.Вставить("Пятнадцать","Пятнадцати");
	ПадежРодительный.Вставить("Шестнадцать","Шестнадцати");
	ПадежРодительный.Вставить("Семнадцать","Семнадцати");
	ПадежРодительный.Вставить("Восемнадцать","Восемнадцати");
	ПадежРодительный.Вставить("Девятнадцать","Девятнадцати");
	ПадежРодительный.Вставить("Двадцать","Двадцати");
	ПадежРодительный.Вставить("Тридцать","Тридцати");
	ПадежРодительный.Вставить("Сорок","Сорока");
	ПадежРодительный.Вставить("Пятьдесят","Пятидесяти");
	ПадежРодительный.Вставить("Шестьдесят","Шестидесяти");
	ПадежРодительный.Вставить("Семьдесят","Семидесяти");
	ПадежРодительный.Вставить("Восемьдесят","Восьмидесяти");
	ПадежРодительный.Вставить("Девяносто","Девяноста");
	ПадежРодительный.Вставить("Сто","Ста");
	ПадежРодительный.Вставить("Двести","Двухсот");
	ПадежРодительный.Вставить("Триста","Трехсот");
	ПадежРодительный.Вставить("Четыреста","Четырехсот");
	ПадежРодительный.Вставить("Пятьсот","Пятисот");
	ПадежРодительный.Вставить("Шестьсот","Шестисот");
	ПадежРодительный.Вставить("Семьсот","Семисот");
	ПадежРодительный.Вставить("Восемьсот","Восьмисот");
	ПадежРодительный.Вставить("Девятьсот","Девятисот");
	ПадежРодительный.Вставить("Тысяча","Тысячи");
	ПадежРодительный.Вставить("Одна","Одной");
	ПадежРодительный.Вставить("Две","Двух");
	ПадежРодительный.Вставить("Тысяч","Тысяч");
	ПадежРодительный.Вставить("Тысячи","Тысяч");
	
	МассивСлов    = Новый Массив;
	Готово 		  = ложь;
	ПервоеСлово   = Истина;
	НовоеСлово    = "";
	Перваябуква   = "";
	Вырезка 	  = "";
	ВернутьОшибка = ЧислоПрописью;
	
	Пока НЕ Готово Цикл
		
		НайденноеЗначение = "";
		НайденныйПробел = Найти(ЧислоПрописью, " ");
		
		Если НайденныйПробел = 0 Тогда
			
			Если ПервоеСлово Тогда
				
				Если ПадежРодительный.Свойство(ЧислоПрописью, НайденноеЗначение) Тогда
					Возврат НайденноеЗначение;
				Иначе
					Возврат ВернутьОшибка;
				КонецЕсли;
				
			Иначе
				
				Вырезка = СокрЛП(ЧислоПрописью);
				Перваябуква = Врег(ЛЕВ(Вырезка, 1));
				ЧислоПрописью = Перваябуква + Прав(Вырезка, СтрДлина(Вырезка) - 1);
				
				Если ПадежРодительный.Свойство(ЧислоПрописью, НайденноеЗначение) Тогда
					НайденноеЗначение = Нрег(НайденноеЗначение);
					НовоеСлово = НовоеСлово + НайденноеЗначение + " ";
					Возврат СокрЛП(НовоеСлово);
				Иначе
					Возврат ВернутьОшибка;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Вырезка = СокрЛП(Лев(ЧислоПрописью,НайденныйПробел));
			Перваябуква = Врег(Лев(Вырезка, 1));
			Вырезка = Перваябуква + Прав(Вырезка, СтрДлина(Вырезка) - 1);
			
			Если ПадежРодительный.Свойство(Вырезка, НайденноеЗначение) Тогда
				
				Если ПервоеСлово Тогда
					
					НовоеСлово = НовоеСлово + НайденноеЗначение + " ";
					первоеСлово = Ложь;
					ЧислоПрописью = СокрЛП(Прав(ЧислоПрописью, СтрДлина(ЧислоПрописью) - НайденныйПробел));
					
				Иначе
					
					НовоеСлово = НовоеСлово + Нрег(НайденноеЗначение) + " ";
					ЧислоПрописью = СокрЛП(Прав(ЧислоПрописью, СтрДлина(ЧислоПрописью) - НайденныйПробел));
					
				КонецЕсли;
			Иначе
				
				Возврат ВернутьОшибка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции

Функция ПерваяБукваЗаглавная(Слово)
	
	Возврат Врег(Лев(Слово, 1)) + Нрег(Сред(Слово, 2));
	
КонецФункции

Функция ПолучитьСтруктуруНадписьПрописью(Сумма)
	
	стВозврата = Новый Структура("НадписьСумма, НадписьКопейки", "", "");
	
	МассивСуммы = СтрРазделить(ЧислоПрописью(Сумма, "Л=ru_RU;ДП=Ложь;"), " ", Ложь);
	
	стВозврата.НадписьСумма = "";
	стВозврата.НадписьКопейки = "";
	
	Для Сч = 0 По МассивСуммы.ВГраница() Цикл
		
		Если Сч = МассивСуммы.ВГраница() Тогда
			
			стВозврата.НадписьКопейки = МассивСуммы[Сч];
			
			Прервать;
			
		КонецЕсли;	
		
		стВозврата.НадписьСумма = стВозврата.НадписьСумма + МассивСуммы[Сч] + " ";
		
	КонецЦикла;	
	
	стВозврата.НадписьСумма = СокрЛП(стВозврата.НадписьСумма);
	стВозврата.НадписьКопейки = СокрЛП(стВозврата.НадписьКопейки);
	
	Возврат стВозврата;
	
КонецФункции

Функция ПолучитьКонтактнуюИнформацию(КонтактноеЛицо)
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("Почта", "");
	СтруктураВозврат.Вставить("Телефон", "");
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Значение,
	|	""Почта"" КАК Тип
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтактногоЛица)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление,
	|	""Телефон""
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица))";
	
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Телефон = "";
	Почта = "";
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = "Почта" Тогда
			Почта = Почта + ?(ЗначениеЗаполнено(Почта), ", ", "") + Выборка.Значение;
		Иначе
			Телефон = Телефон + ?(ЗначениеЗаполнено(Телефон), ", ", "") + Выборка.Значение;
		КонецЕсли;
		
	КонецЦикла;	
	
	СтруктураВозврат.Вставить("Телефон", Телефон);
	СтруктураВозврат.Вставить("Почта", Почта);
	
	Возврат СтруктураВозврат;
	
КонецФункции

Процедура ВычислитьМаксНомерКлюча(МаксНомерКлюча, ТаблицаСвязей)

	Для Каждого СтрКлюча Из ТаблицаСвязей Цикл
	
		СтруктураКлюча = ПолучитьИмяБезЦифр(СтрКлюча.ИдРесурса);
		
		Если СтруктураКлюча.Номер > МаксНомерКлюча Тогда
			МаксНомерКлюча = СтруктураКлюча.Номер;	
		КонецЕсли;	
		
	КонецЦикла;	

КонецПроцедуры

Функция ПолучитьИмяБезЦифр(Знач Имя)

	МассивКлюча = СтрРазделить(Имя, "0123456789", Ложь);

	Если МассивКлюча.Количество() > 1 Тогда
		ВызватьИсключение НСтр("ru = 'Неожиданный ключ'");
	КонецЕсли;
	
	Результат = Новый Структура ("ШаблонИмени, Номер");
	
	Результат.ШаблонИмени 	= МассивКлюча[0] + "%1";
	
	НеНужныеСимволы = СтрСоединить(МассивКлюча, "");
	
	МассивНомеров = СтрРазделить(Имя, НеНужныеСимволы, Ложь);
	
	Если МассивНомеров.Количество() > 1 Тогда
		ВызватьИсключение НСтр("ru = 'Неожиданный ключ, несколько номеров'");
	КонецЕсли;
	
	Результат.Номер	= Число(МассивНомеров[0]);

	Возврат Результат;
	
КонецФункции

#КонецОбласти
